tap "homebrew/core"
brew "bat"
brew "btop"
brew "cjson"
brew "dav1d"
brew "dos2unix"
brew "exa"
brew "fontconfig"
brew "gcc"
brew "git"
brew "go-task"
brew "nvm"
brew "openjdk"
brew "openssl@3"
brew "pkg-config"
brew "pnpm"
brew "pyenv"
brew "fzf"
brew "shellcheck"
brew "ffmpeg"
brew "webp"
brew "duf"

tap "homebrew/cask"
cask "alt-tab"
cask "bitwarden"
cask "cakebrew"
cask "discord"
cask "docker"
cask "github"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "postman"
cask "shottr"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "vlc"

tap "homebrew/cask-fonts"
cask "font-monaspace"

tap "rcmdnk/file"
brew "brew-file"