tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "rcmdnk/file"
brew "bat"
brew "gcc"
brew "btop"
brew "dav1d"
brew "dos2unix"
brew "duf"
brew "elm"
brew "elm-format"
brew "eza"
brew "svt-av1"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go-task"
brew "graphviz"
brew "hadolint"
brew "maven"
brew "nano"
brew "nanorc"
brew "nvm"
brew "pnpm"
brew "pyenv"
brew "rustup-init"
brew "sevenzip"
brew "shellcheck"
brew "tree"
cask "alt-tab"
cask "bitwarden"
cask "cakebrew"
cask "discord"
cask "docker"
cask "font-monaspace"
cask "github"
cask "google-chrome"
cask "intellij-idea"
cask "iterm2"
cask "lunar-client"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "orbstack"
cask "postman"
cask "shottr"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "vlc"
vscode "13xforever.language-x86-64-assembly"
vscode "ahmadalli.vscode-nginx-conf"
vscode "AnbuselvanRocky.bootstrap5-vscode"
vscode "aperricone.vscode-dbf"
vscode "bierner.emojisense"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "BrenoRangel.selene-theme"
vscode "christian-kohler.path-intellisense"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "elmTooling.elm-ls-vscode"
vscode "esbenp.prettier-vscode"
vscode "evan-buss.font-switcher"
vscode "exiasr.hadolint"
vscode "fnando.linter"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.docker-explorer"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hbenl.vscode-test-explorer"
vscode "jbenden.c-cpp-flylint"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "kamikillerto.vscode-colorize"
vscode "KevinRose.vsc-python-indent"
vscode "luggage66.AWK"
vscode "mrcrowl.hg"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-fr"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "MylesMurphy.prettify-ts"
vscode "pflannery.vscode-versionlens"
vscode "PKief.material-icon-theme"
vscode "Prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-yaml"
vscode "rifi2k.format-html-in-php"
vscode "rust-lang.rust-analyzer"
vscode "sbrink.elm"
vscode "shakram02.bash-beautify"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "xaver.clang-format"
vscode "YoavBls.pretty-ts-errors"
vscode "yy0931.save-as-root"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzhang.markdown-all-in-one"
vscode "ZixuanChen.vitest-explorer"
