tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "rcmdnk/file"
tap "supabase/tap"
brew "xz"
brew "bat"
brew "biome"
brew "gcc"
brew "btop"
brew "caddy"
brew "python@3.12"
brew "dav1d"
brew "dos2unix"
brew "duf"
brew "elm"
brew "elm-format"
brew "eza"
brew "svt-av1"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go-task"
brew "graphviz"
brew "gzip"
brew "hadolint"
brew "kubernetes-cli"
brew "maven"
brew "minikube"
brew "nano"
brew "nanorc"
brew "pnpm"
brew "proto"
brew "rustup-init"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "topgrade"
brew "tree"
brew "unzip"
brew "supabase/tap/supabase"
cask "alt-tab"
cask "bitwarden"
cask "discord"
cask "docker"
cask "font-monaspace"
cask "github"
cask "google-chrome"
cask "hoppscotch"
cask "intellij-idea"
cask "iterm2"
cask "latest"
cask "lens"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "orbstack"
cask "postman"
cask "raycast"
cask "shottr"
cask "spotify"
cask "steam"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "zed"
vscode "ahmadalli.vscode-nginx-conf"
vscode "aperricone.vscode-dbf"
vscode "bierner.emojisense"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "brenorangel.selene-theme"
vscode "chakrounanas.turbo-console-log"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "fivepointseven.node-version"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql-syntax"
vscode "hbenl.vscode-test-explorer"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "jmkrivocapich.drawfolderstructure"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "million.million-lint"
vscode "mrcrowl.hg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-fr"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "mylesmurphy.prettify-ts"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rifi2k.format-html-in-php"
vscode "rust-lang.rust-analyzer"
vscode "shakram02.bash-beautify"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "suhelmakkad.shadcn-ui"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "vitest.explorer"
vscode "xaver.clang-format"
vscode "yoavbls.pretty-ts-errors"
vscode "yy0931.save-as-root"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzhang.markdown-all-in-one"
vscode "zamerick.vscode-caddyfile-syntax"
