tap "axodotdev/tap"
tap "codecrafters-io/tap"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "jesseduffield/lazydocker"
tap "rcmdnk/file"
tap "stripe/stripe-cli"
tap "supabase/tap"
brew "xz"
brew "libgit2"
brew "libgit2@1.7"
brew "bat"
brew "biome"
brew "btop"
brew "caddy"
brew "python@3.12"
brew "dav1d"
brew "dive"
brew "dos2unix"
brew "duf"
brew "elm"
brew "eza"
brew "fastfetch"
brew "svt-av1"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gcc"
brew "git"
brew "git-cliff"
brew "gnupg"
brew "go-task"
brew "graphviz"
brew "gzip"
brew "hadolint"
brew "hyperfine"
brew "just"
brew "openjdk"
brew "ktlint"
brew "kubernetes-cli"
brew "libimobiledevice"
brew "libpq"
brew "maven"
brew "minikube"
brew "nano"
brew "nanorc"
brew "pinentry-mac"
brew "pnpm"
brew "rustup"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "topgrade"
brew "tree"
brew "typos-cli"
brew "unzip"
brew "uv"
brew "watch"
brew "xcodegen"
brew "yazi"
brew "zizmor"
brew "codecrafters-io/tap/codecrafters"
brew "derailed/k9s/k9s"
brew "jesseduffield/lazydocker/lazydocker"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
cask "alex313031-thorium"
cask "alt-tab"
cask "android-commandlinetools"
cask "android-studio"
cask "bitwarden"
cask "burp-suite"
cask "claude"
cask "discord"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "github@beta"
cask "google-chrome"
cask "hoppscotch"
cask "intellij-idea"
cask "iterm2"
cask "latest"
cask "lens"
cask "localsend"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-teams"
cask "orbstack"
cask "postman"
cask "raycast"
cask "shottr"
cask "spotify"
cask "steam"
cask "temurin"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "whatsapp"
cask "zed"
cask "zen-browser"
vscode "ahmadalli.vscode-nginx-conf"
vscode "antfu.open-in-github-button"
vscode "aperricone.vscode-dbf"
vscode "bierner.emojisense"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "brenorangel.selene-theme"
vscode "burkeholland.simple-react-snippets"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "damienaicheh.azure-pipeline-yaml-generator"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "fabiospampinato.vscode-open-in-github"
vscode "fivepointseven.node-version"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "hbenl.vscode-test-explorer"
vscode "jerrygoyal.shortcut-menu-bar"
vscode "jmkrivocapich.drawfolderstructure"
vscode "kamikillerto.vscode-colorize"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "million.million-lint"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-fr"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "mylesmurphy.prettify-ts"
vscode "nefrob.vscode-just-syntax"
vscode "oven.bun-vscode"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rifi2k.format-html-in-php"
vscode "rust-lang.rust-analyzer"
vscode "shakram02.bash-beautify"
vscode "suhelmakkad.shadcn-ui"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "xaver.clang-format"
vscode "yoavbls.pretty-ts-errors"
vscode "yutengjing.package-manager-enhancer"
vscode "yy0931.save-as-root"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
